Revit 2027 API
PipeSettings.AnalysisForClosedLoopHydronicPipingNetworks Property
 Indicates whether to enable analysis for closed loop hydronic piping networks.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool AnalysisForClosedLoopHydronicPipingNetworks { get; set; }
Public Property AnalysisForClosedLoopHydronicPipingNetworks As Boolean
	Get
	Set
public:
property bool AnalysisForClosedLoopHydronicPipingNetworks {
	bool get ();
	void set (bool value);
}
member AnalysisForClosedLoopHydronicPipingNetworks : bool with get, set
Property Value
Boolean
Remarks
For closed loop hydronic piping networks, Revit can analyze flow and pressure values for supply and return loops. In the model, select a pump to see the results of the analysis in the Properties palette.
A closed loop hydronic piping network must contain:
A single pump/circulator
A single source, such as a boiler
Multiple piping segments
Multiple terminals, such as radiators.
A network may contain a direct return loop or a reverse return loop.
See Also
Reference
PipeSettings Class
Autodesk.Revit.DB.Plumbing Namespace